---
kind: property
id: P:Autodesk.Revit.UI.FamilyInstancePlacingArgs.StatusMessage
source: html/026c15f6-a8e6-2744-af3e-5a7381424710.htm
---
# Autodesk.Revit.UI.FamilyInstancePlacingArgs.StatusMessage Property

The message to be shown on the status bar

## Syntax (C#)
```csharp
public string StatusMessage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null